app/Controllers/Admin/DashboardController.php

    public function index()
    {
        // 🔐 Vérification simple de l'authentification
        if (!session()->get('admin_logged_in')) {
            return redirect()->to('/admin/login')->with('error', 'Veuillez vous connecter');
        }

        try {
            $projectModel = new ProjectModel();
            $messageModel = new MessageModel();

            // 🔴 CORRECTION: Utiliser findAll() au lieu de find()
            $recent_messages = $messageModel->orderBy('created_at', 'DESC')->limit(5)->findAll();
            $recent_projects = $projectModel->orderBy('created_at', 'DESC')->limit(5)->findAll();

            $data = [
                'title' => 'Tableau de Bord - Admin',
                'settings' => $this->settings ?? [],
                'stats' => [
                    'total_projects' => $projectModel->countAll(),
                    'featured_projects' => $projectModel->where('featured', 1)->countAllResults(),
                    'unread_messages' => $messageModel->where('is_read', 0)->countAllResults(),
                    'total_messages' => $messageModel->countAll(),
                    // 🔴 AJOUTER AVEC GESTION D'ERREUR
                    'total_skills' => $this->getSkillsCount(),
                    'upcoming_events' => $this->getUpcomingEventsCount(),
                    'archived_messages' => $messageModel->where('is_archived', 1)->countAllResults()
---
SELECT *
FROM `messages`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `projects`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `featured` = 1
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `is_read` = 0
SELECT COUNT(*) AS `numrows` FROM `messages`
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `is_archived` = 1

    private function getSkillsCount()
    {
        try {
            if (class_exists('App\Models\SkillModel')) {
                $skillModel = new \App\Models\SkillModel();
                return $skillModel->where('is_active', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `skills`
WHERE `is_active` = 1

    private function getUpcomingEventsCount()
    {
        try {
            if (class_exists('App\Models\EventModel')) {
                $eventModel = new \App\Models\EventModel();
                return $eventModel->where('event_date >=', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `event_date` >= '2025-09-26'