app/Controllers/Admin/MessageController.php

SELECT *
FROM `messages`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $this->checkAdminAccess();

        // 🔴 CORRECTION : Récupérer les messages avec gestion d'erreur
        try {
            $messages = $this->messageModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `messages`
WHERE `messages`.`id` = '1'
SELECT *
FROM `messages`
WHERE `id` < '1'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `messages`
WHERE `id` > '1'
ORDER BY `id` ASC
 LIMIT 1
---
    public function show($id = null)
    {
        $this->checkAdminAccess();

        if ($id === null) {
            return redirect()->to('/admin/messages')->with('error', 'Aucun message spécifié');
        }

        // Utiliser l'instance existante de messageModel
        $message = $this->messageModel->find($id);

        if (!$message) {
            return redirect()->to('/admin/messages')->with('error', 'Message non trouvé');
        }

        // 🔴 SUPPRIMER le marquage automatique ici
        // Le message sera marqué comme lu SEULEMENT via le bouton

        // Navigation avec la même instance
        try {
            $previous_message = $this->messageModel
                ->where('id <', $id)
                ->orderBy('id', 'DESC')
                ->first();

            $next_message = $this->messageModel
                ->where('id >', $id)
                ->orderBy('id', 'ASC')
                ->first();