app/Controllers/ProjectController.php

SELECT *
FROM `projects`
WHERE `slug` = 'avb'
 LIMIT 1
---
    public function show($slug)
    {
        $project = $this->projectModel->where('slug', $slug)->first();