app/Models/PortfolioModel.php

SELECT *
FROM `projects`
WHERE `featured` = 1
AND `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 6
---
    public function getFeaturedProjects($limit = null)
    {
        try {
            $projectModel = new \App\Models\ProjectModel();
            $projects = $projectModel->where('featured', 1)
                                  ->where('status', 'active')
                                  ->orderBy('created_at', 'DESC');

            if ($limit) {
                $projects = $projects->findAll($limit);

SELECT *
FROM `projects`
WHERE `status` = 'active'
ORDER BY `created_at` DESC
---
    public function getAllProjects()
    {
        try {
            $projectModel = new \App\Models\ProjectModel();
            return $projectModel->where('status', 'active')
                            ->orderBy('created_at', 'DESC')
                            ->findAll();

SELECT *
FROM `skills`
WHERE `is_active` = 1
ORDER BY `display_order` ASC
---
    public function getSkillsByCategory()
    {
        try {
            $skillModel = new \App\Models\SkillModel();
            $skills = $skillModel->where('is_active', 1)
                               ->orderBy('display_order', 'ASC')
                               ->findAll();

SELECT *
FROM `experiences`
ORDER BY `start_date` DESC
---
    public function getExperiences()
    {
        try {
            $experienceModel = new \App\Models\ExperienceModel();
            return $experienceModel->orderBy('start_date', 'DESC')->findAll();

SELECT *
FROM `events`
WHERE `is_featured` = 1
ORDER BY `event_date` DESC
 LIMIT 6
---
    public function getFeaturedEvents($limit = 6)
    {
        try {
            $eventModel = new \App\Models\EventModel();
            $events = $eventModel->where('is_featured', 1)
                               ->orderBy('event_date', 'DESC');

            if ($limit) {
                $events = $events->findAll($limit);